package com.nico.index;

public class TestData {
	//config
	public static final String INDEX_PATH="E:\\index\\nico";
	//data
	public static final String[] IDS = {"1", "2", "3", "4", "5", "6"};
	public static final String[] NAMES= {"南京市", "江西省", "广东省", "江苏省", "浙江省", "广西省"};
	public static final String[] TITLES = {"南京java SeacherDemo", "江西 php ReaderDemo rdww", "广东 WriterDemo 3edde ", "江苏 TestData sdfdsf", "浙江 LuceneUtil.java", "广西 pom.xml"};
	public static final String[] CONTENTS = {
            "南京地处中国东部、长江下游、濒江近海，是中国东部战区司令部驻地 [5]  ，长江国际航运物流中心 [6-9]  ，长三角辐射带动中西部地区发展的国家重要门户城市，也是东部沿海经济带与长江经济带战略交汇的重要节点城市。",
            "江西地处中国东南部，北纬24°29′14″至30°04′41″，东经113°34′36″至118°28′58″之间，东邻浙江省、福建省，南连广东省，西接湖南省，北毗湖北省、安徽省而共接长江。是长江经济带重要组成部分。",
            "广东在先秦时已存在新石器时代和青铜时代高度文明，是中华文明的发源地之一 [7]  。广东是中国的南大门，处在南海航运枢纽位置上，广东人民从秦汉开始，就通过海洋走上与世界各地交往的道路，成为海上丝绸之路最早发源地 [8]  。改革开放后，广东成为改革开放前沿阵地和引进西方经济、文化、科技的窗口，取得骄人的成绩。",
            "江苏辖江临海，扼淮控湖，经济繁荣，教育发达，文化昌盛，素有“山水江南、鱼米之乡”的美誉，地理上跨越南北，同时具有南方和北方的特征 [4]  。江苏地形以平原为主，面积10.72万平方千米，占中国的1.12%，人均国土面积在中国各省区中最少，是中国面积较小的省份之一。 [5] ",
            "浙江是典型的山水江南、鱼米之乡，被称为“丝绸之府”、“鱼米之乡”。早在5万年前的旧石器时代，就有原始人类“建德人”活动；境内有距今7000年的河姆渡文化、距今6000年的马家浜文化和距今5000年的良渚文化等文化遗存；是吴越文化、江南文化的发源地，中国古代文明的发祥地之一。",
            "广西先秦时已存在新石器时代和青铜时代高度文明，境内有距今7000年的甑皮岩遗址、白莲洞遗址等文化遗存，是桂柳文化、岭南文明的发源地，是中华文明的发祥地之一，广西是中国—东盟博览会的举办地，在中国与东南亚的经济交往中占有重要地位，是西南地区最便捷的出海通道。 [3] "
    };
	
	public static final String[] CONTENTS_NO_SAVE = {
            "南京地处中国东部、长江下游、濒江近海，是中国东部战区司令部驻地 [5]  ，长江国际航运物流中心 [6-9]  ，长三角辐射带动中西部地区发展的国家重要门户城市，也是东部沿海经济带与长江经济带战略交汇的重要节点城市。",
            "江西地处中国东南部，北纬24°29′14″至30°04′41″，东经113°34′36″至118°28′58″之间，东邻浙江省、福建省，南连广东省，西接湖南省，北毗湖北省、安徽省而共接长江。是长江经济带重要组成部分。",
            "广东在先秦时已存在新石器时代和青铜时代高度文明，是中华文明的发源地之一 [7]  。广东是中国的南大门，处在南海航运枢纽位置上，广东人民从秦汉开始，就通过海洋走上与世界各地交往的道路，成为海上丝绸之路最早发源地 [8]  。改革开放后，广东成为改革开放前沿阵地和引进西方经济、文化、科技的窗口，取得骄人的成绩。",
            "江苏辖江临海，扼淮控湖，经济繁荣，教育发达，文化昌盛，素有“山水江南、鱼米之乡”的美誉，地理上跨越南北，同时具有南方和北方的特征 [4]  。江苏地形以平原为主，面积10.72万平方千米，占中国的1.12%，人均国土面积在中国各省区中最少，是中国面积较小的省份之一。 [5] ",
            "浙江是典型的山水江南、鱼米之乡，被称为“丝绸之府”、“鱼米之乡”。早在5万年前的旧石器时代，就有原始人类“建德人”活动；境内有距今7000年的河姆渡文化、距今6000年的马家浜文化和距今5000年的良渚文化等文化遗存；是吴越文化、江南文化的发源地，中国古代文明的发祥地之一。",
            "广西先秦时已存在新石器时代和青铜时代高度文明，境内有距今7000年的甑皮岩遗址、白莲洞遗址等文化遗存，是桂柳文化、岭南文明的发源地，是中华文明的发祥地之一，广西是中国—东盟博览会的举办地，在中国与东南亚的经济交往中占有重要地位，是西南地区最便捷的出海通道。 [3] "
    };
}
